Repository: ShutterStarTW/wp-autoplugin
Catalog: languages/wp-autoplugin-*.po
Languages: fr, hu_hu

source: A plugin that generates other plugins on-demand using AI.
fr: Une extension qui génère d’autres extensions à la demande en utilisant l’IA.
hu_hu: AI alapú bővítmény-generáló bővítmény.

source: Balázs Piller
hu_hu: Piller Balázs

source: Generate New Plugin
fr: Générer une nouvelle extension
hu_hu: Új bővítmény generálása

source: Settings
fr: Réglages
hu_hu: Beállítások

source: Extend Plugin
fr: Améliorer l’extension
hu_hu: Bővítmény továbbfejlesztése

source: Fix Plugin
fr: Corriger l’extension
hu_hu: Bővítmény javítása

source: No plugin specified.
fr: Aucune extension spécifiée.
hu_hu: Nincs megadva bővítmény.

source: You do not have sufficient permissions to access this page.
fr: Vous ne disposez pas des autorisations suffisantes pour accéder à cette page.
hu_hu: Nincs megfelelő jogosultságod az oldal eléréséhez.

source: Security check failed.
fr: Le contrôle de sécurité a échoué.
hu_hu: A biztonsági ellenőrzés sikertelen volt.

source: The specified plugin does not exist.
fr: L’extension spécifiée n’existe pas.
hu_hu: A megadott bővítmény nem létezik.

source: Please enter a plugin description.
fr: Veuillez saisir une description de l’extension.
hu_hu: Kérjük, adj meg egy bővítmény leírást.

source: Generating a plan for your plugin
fr: Génération d’un plan pour votre extension
hu_hu: Bővítmény terv generálása

source: Error generating the plugin plan.
fr: Erreur de génération du plan pour l’extension.
hu_hu: Hiba történt a bővítmény terv generálása közben.

source: Generating code
fr: Génération du code
hu_hu: Kód generálása

source: Error generating the plugin code.
fr: Erreur de génération du code de l’extension.
hu_hu: Hiba történt a bővítmény kód generálása közben.

source: Error creating the plugin.
fr: Erreur lors de la création de l’extension.
hu_hu: Hiba történt a bővítmény létrehozása közben.

source: Installing the plugin
fr: Installation de l’extension.
hu_hu: Bővítmény telepítése

source: Plugin successfully installed.
fr: Extension installée avec succès.
hu_hu: A bővítmény sikeresen telepítve.

source: How to test it?
fr: Comment la tester ?
hu_hu: Hogyan tesztelheted?

source: If you notice any issues, use the Fix button in the Autoplugins list.
fr: Si vous constatez des problèmes, utilisez le bouton Corriger dans la liste des Autoplugins.
hu_hu: Ha hibát észlelsz, használd a Javítás gombot az Autopluginok listában.

source: Activate Plugin
fr: Activer l’extension
hu_hu: Bővítmény bekapcsolása

source: A simple contact form with honeypot spam protection
fr: Un formulaire de contact simple avec une protection anti-spam de type honeypot
hu_hu: Egyszerű kapcsolatfelvételi űrlap spam védelemmel

source: A custom post type for testimonials
fr: Un type de publication personnalisé pour les témoignages
hu_hu: Egyedi bejegyzéstípus értékelésekhez

source: A widget that displays recent posts
fr: Un widget qui affiche les publications récentes
hu_hu: Widget, a legújabb bejegyzések megjelenítéséhez

source: A shortcode that shows a random quote
fr: Un code court qui affiche une citation aléatoire
hu_hu: Egy shortcode, véletlenszerű idézetekhez

source: A user profile widget displaying avatar, bio, and website link
fr: Un widget de profil d’utilisateur/utilisatrice affichant l’avatar, la biographie et le lien vers le site
hu_hu: Felhasználói profil widget, avatarral, leírással, és linkkel

source: A custom post type for managing FAQs
fr: Un type de publication personnalisé pour gérer les FAQ
hu_hu: Egyedi bejegyzéstípus GYIK kezeléséhez

source: A post views counter that tracks and displays view counts
fr: Un compteur de vues de publications qui permet de suivre et d’afficher le nombre de vues.
hu_hu: Bejegyzés megtekintés számláló

source: Maintenance mode with a countdown timer to site return
fr: Mode maintenance avec compte à rebours jusqu’au retour du site
hu_hu: Karbantartási mód, visszaszámlálóval az oldal visszatéréséhez

source: An admin quick links widget for the dashboard
fr: Un widget de liens rapides pour le tableau de bord
hu_hu: Gyorslinkek widget a WP-admin felülethez

source: Hide the admin bar for non-admin users
fr: Masquer la barre d'administration pour les comptes non administrateurs
hu_hu: A felső admin sáv elrejtése nem-admin felhasználók számára

source: Hide specific menu items in the admin area
fr: Masquer des éléments de menu spécifiques dans la zone d’administration
hu_hu: Specifikus menüpontok elrejtése az admin menüben

source: A social media share buttons plugin for posts
fr: Une extension de boutons de partage de médias sociaux pour les articles
hu_hu: Közösségi megosztás gombok bővítmény bejegyzésekhez

source: A custom footer credit remover
fr: Un suppresseur de crédit de pied de page personnalisé
hu_hu: Credits szöveg eltávolítása a láblécből

source: A plugin to add custom CSS to the WordPress login page
fr: Une extension pour ajouter du CSS personnalisé à la page de connexion de WordPress
hu_hu: Egyedi CSS a WordPress bejelentkező oldalhoz

source: A related posts display below single post content
fr: Un affichage des articles connexes sous le contenu de l’article
hu_hu: Kapcsolódó bejegyzések megjelenítése a bejegyzés tartalma alatt

source: A custom excerpt length controller
fr: Un contrôleur de longueur d’extrait personnalisé
hu_hu: Egyedi kivonat hosszúság vezérlő

source: A "Back to Top" button for long pages
fr: Un bouton « Retour en haut » pour les pages longues
hu_hu: "Vissza az elejére" gomb hosszú oldalakhoz

source: A plugin to disable comments on specific post types
fr: Une extension pour désactiver les commentaires sur des types de publications spécifiques
hu_hu: Hozzászólások letiltása választott bejegyzéstípusoknál

source: A simple Google Analytics integration
fr: Une intégration simple de Google Analytics
hu_hu: Egyszerű Google Analytics integráció

source: An author box display below posts
fr: Un affichage d’une boîte d'auteur sous les articles
hu_hu: Szerzői doboz megjelenítése a bejegyzések alatt

source: A custom breadcrumb generator
fr: Un générateur de fil d’ariane personnalisé
hu_hu: Egyedi kenyérmorzsa-navigáció

source: A plugin to add nofollow to external links
fr: Une extension pour ajouter nofollow aux liens externes
hu_hu: Nofollow hozzáadása a külső hivatkozásokhoz

source: A simple cookie consent banner
fr: Une bannière simple de consentement aux cookies
hu_hu: Egyszerű, sütik elfogadására figyelmeztető banner

source: A post expiration date setter
fr: Une extension ajoutant une date d'expiration aux articles
hu_hu: A bejegyzésekhez beállítható lejárati dátum, amikor azok eltűnnek

source: A basic XML sitemap generator
fr: Un générateur de sitemap XML basique
hu_hu: Egyszerű XML oldaltérkép generátor

source: A custom login URL creator for added security
fr: Un créateur d'URL de connexion personnalisé pour plus de sécurité
hu_hu: Egyedi bejelentkezési URL, a biztonságért

source: A simple contact information display shortcode
fr: Un shortcode simple pour l’affichage des informations de contact
hu_hu: Kapcsolati információkat megjelenítő rövidkód

source: A plugin to add estimated reading time to posts
fr: Une extension pour ajouter le temps de lecture estimé aux publications
hu_hu: Becsült olvasási idő megjelenítése a bejegyzéseknél

source: A custom RSS feed footer
fr: Un pied de page personnalisé pour les flux RSS
hu_hu: Egyedi RSS hírcsatorna lábléc

source: A simple post duplication tool
fr: Un outil simple de duplication de publications
hu_hu: Egyszerű bejegyzés másoló eszköz

source: A basic schema markup generator
fr: Un générateur basique de balises schéma
hu_hu: Egyszerű schema markup generátor

source: A plugin to add custom admin footer text
fr: Une extension pour ajouter un texte personnalisé au pied de page de l’administration
hu_hu: Bővítmény egyedi admin lábléc szöveg hozzáadásához

source: A plugin to add custom taxonomies easily
fr: Une extension pour ajouter facilement des taxonomies personnalisées
hu_hu: Bővítmény egyedi taxonómiák könnyű hozzáadásához

source: A simple email obfuscator to prevent spam
fr: Un obfuscateur d’e-mail simple pour éviter les indésirables
hu_hu: Egyszerű e-mail elrejtő eszköz a spam elkerülésére

source: A basic redirection manager
fr: Un gestionnaire de redirection basique
hu_hu: Egyszerű átirányítás kezelő

source: A plugin to add custom fields to user profiles
fr: Une extension pour ajouter des champs personnalisés aux profils des utilisateurs
hu_hu: Egyedi mezők hozzáadása a felhasználói profilokhoz

source: A simple image compression tool
fr: Un outil simple de compression d’images
hu_hu: Egyszerű képtömörítő eszköz

source: Error generating the plan.
fr: Erreur de génération du plan.
hu_hu: Hiba történt a terv generálása közben.

source: Error creating the fixed plugin.
fr: Erreur lors de la création de l’extension corrigée.
hu_hu: Hiba történt a javított bővítmény létrehozása közben.

source: Generating the fixed plugin code
fr: Génération du code de l’extension corrigée
hu_hu: Javított bővítménykód generálása

source: Error generating the fixed code.
fr: Erreur de génération du code corrigé.
hu_hu: Hiba történt a javított kód generálása közben.

source: The plugin code has been updated.
fr: Le code de l’extension a été mis à jour.
hu_hu: A bővítmény kódja frissítve.

source: Installing the fix
fr: Installation du correctif
hu_hu: Javítás telepítése

source: Please describe the changes you want to make to the plugin.
fr: Veuillez décrire les modifications que vous souhaitez apporter à l’extension.
hu_hu: Kérjük, írd le, milyen változtatásokat szeretnél végrehajtani a bővítményen.

source: Error generating the development plan.
fr: Erreur de génération du plan de développement.
hu_hu: Hiba történt a fejlesztési terv generálása közben.

source: Generating the extended plugin code
fr: Génération de l’amélioration du code de l’extension
hu_hu: A bővítmény kibővített kódjának generálása

source: Error generating the extended code.
fr: Erreur de génération du code amélioré.
hu_hu: Hiba történt a bővített kód generálása közben.

source: Error creating the extended plugin.
fr: Erreur lors de la création de l’extension améliorée.
hu_hu: Hiba történt a kibővített bővítmény létrehozása közben.

source: Creating the plugin
fr: Création de l’extension
hu_hu: Bővítmény létrehozása

source: The plugin could not be activated due to a fatal error.
fr: L’extension n’a pas pu être activée en raison d’une erreur fatale.
hu_hu: A bővítményt nem lehetett aktiválni végzetes hiba miatt.

source: You can <a href="%s">fix the error automatically</a>.
fr: Vous pouvez <a href="%s">corriger l’erreur automatiquement</a>.
hu_hu: A hibát <a href="%s">automatikusan javíthatod</a>.

source: Model: %s
fr: Modèle : %s
hu_hu: Modell: %s

source: Plugin
fr: Extension
hu_hu: Bővítmény

source: Deactivate
fr: Désactiver
hu_hu: Kikapcsolás

source: Activate
fr: Activer
hu_hu: Bekapcsolás

source: Fix
fr: Corriger
hu_hu: Javítás

source: Extend
fr: Améliorer
hu_hu: Kibővítés

source: Delete
fr: Supprimer
hu_hu: Törlés

source: No plugins found.
fr: Aucune extension trouvée.
hu_hu: Nincs találat bővítményre.

source: All
fr: Toutes
hu_hu: Összes

source: Active
fr: Actives
hu_hu: Aktív

source: Inactive
fr: Inactives
hu_hu: Inaktív

source: Error communicating with the API.
hu_hu: Hiba történt az API-val való kommunikáció közben.

source: The plugin has been updated, but could not be reactivated. Please reactivate it manually.
fr: L’extension a été mise à jour, mais n’a pas pu être réactivée. Veuillez la réactiver manuellement.
hu_hu: A bővítmény frissítve lett, de nem sikerült újraaktiválni. Kérlek, aktiváld újra kézzel.

source: Plugin reactivated successfully.
fr: L’extension a été réactivée avec succès.
hu_hu: A bővítmény sikeresen újraaktiválva.

source: Error while activating the plugin: %s
fr: Erreur lors de l’activation de l’extension : %s
hu_hu: Hiba történt a bővítmény aktiválása közben: %s

source: Extend This Plugin: %s
fr: Améliorer cette extension : %s
hu_hu: Bővítés: %s

source: Describe the changes you would like to make to the plugin. Include as much detail as possible:
fr: Décrivez les modifications que vous souhaitez apporter à l’extension. Incluez autant de détails que possible :
hu_hu: Írd le a bővítményen végrehajtani kívánt módosításokat. Minél részletesebb leírást adj meg:

source: Generated Plan
fr: Plan généré
hu_hu: Generált terv

source: Review or edit the generated plan:
fr: Vérifier ou modifier le plan généré :
hu_hu: Nézd át vagy szerkeszd a generált tervet:

source: &laquo; Edit Issue
fr: " Modifier le problème
hu_hu: &laquo; Hiba szerkesztése

source: Generate Plugin Code
fr: Générer le code de l’extension
hu_hu: Bővítménykód generálása

source: Extended Plugin: %s
fr: Extension amériorée : %s
hu_hu: Kibővített bővítmény: %s

source: The plugin has been extended successfully. You can review the changes before activating it:
fr: L’extension a été améliorée avec succès. Vous pouvez consulter les changements avant de l'activer :
hu_hu: A bővítmény sikeresen kibővítve. Aktiválás előtt áttekintheted a változtatásokat:

source: Warning:
fr: Avertissement :
hu_hu: Figyelmeztetés:

source: This plugin is active, changes will take effect immediately.
fr: Cette extension est active, les modifications prendront effet immédiatement.
hu_hu: Ez a bővítmény aktív, a változások azonnal érvénybe lépnek.

source: &laquo; Edit Plan
fr: "Modifier le plan
hu_hu: &laquo; Terv szerkesztése

source: Save Changes
fr: Enregistrer les modifications
hu_hu: Változtatások mentése

source: Fix This Plugin: %s
fr: Corrigez cette extension : %s
hu_hu: Javítás: %s

source: Describe the issue you are experiencing with the plugin. Include as much detail as possible and any error messages you are seeing:
fr: Décrivez le problème que vous rencontrez avec l’extension. Incluez autant de détails que possible et tous les messages d'erreur que vous voyez :
hu_hu: Írd le a bővítmény használata közben tapasztalt problémát. Minél részletesebb leírást adj meg, és tüntesd fel a hibaüzeneteket is:

source: Look for other issues in the plugin code as well
fr: Recherchez également d’autres problèmes dans le code de l’extension
hu_hu: Keressen más hibákat is a bővítmény kódban

source: Focus on the issue at hand
fr: Se concentrer sur le problème en cours
hu_hu: Csak a megadott problémára koncentráljon

source: Fixed Plugin: %s
fr: Extension corrigée : %s
hu_hu: Javított bővítmény: %s

source: The plugin has been fixed successfully. You can review the changes before activating it:
fr: L’extension a été corrigée avec succès. Vous pouvez consulter les modifications avant de l’activer :
hu_hu: A bővítmény sikeresen javítva. Aktiválás előtt áttekintheted a változtatásokat:

source: Generate Plugin
fr: Générer une extension
hu_hu: Bővítmény generálása

source: Enter a description of the plugin you want to generate:
fr: Entrez la description de l’extension que vous souhaitez générer :
hu_hu: Add meg a létrehozni kívánt bővítmény leírását:

source: Generate Plan
fr: Générer un plan
hu_hu: Plugin terv generálása

source: &laquo; Edit Description
fr: "Modifier la description
hu_hu: &laquo; Leírás szerkesztése

source: Generated Plugin Code
fr: Code de l’extension généré
hu_hu: Generált bővítménykód

source: The plugin code has been generated successfully. You can review and edit the plugin file before activating it:
fr: Le code de l’extension a été généré avec succès. Vous pouvez vérifier et éditer le fichier de l’extension avant de l’activer :
hu_hu: A bővítménykód sikeresen generálva. Aktiválás előtt áttekintheted és szerkesztheted a bővítmény fájlt:

source: AI-generated code may be unstable or insecure; use only after careful review and testing.
fr: Le code généré par l'IA peut être instable ou peu sûr ; ne l’utilisez qu’après l’avoir soigneusement examiné et testé.
hu_hu: Az AI által generált kód instabil lehet és biztonsági hibákat tartalmazhat. Csak alapos kódellenőrzés és tesztelés után használd.

source: Install Plugin
fr: Installer l’extension
hu_hu: Bővítmény telepítése

source: Autoplugins
hu_hu: Autopluginok

source: You don't have any autoplugins yet.
fr: Vous n’avez pas encore d’autoplugins.
hu_hu: Még nincsenek autopluginok.

source: Autoplugins are regular plugins, but they are generated by AI. You can manage them just like any other plugin. They will be listed here for your convenience.
fr: Les Autoplugins sont des extensions normales, mais elles sont générées par l’IA. Vous pouvez les gérer comme n’importe quelle autre extension. Elles sont répertoriées ici par commodité.
hu_hu: Az autopluginok hagyományos bővítmények, amelyeket mesterséges intelligencia hozott létre. Ugyanúgy kezelheted őket, mint bármely más bővítményt. Itt fel lesznek sorolva, hogy könnyen elérhetőek legyenek.

source: WP-Autoplugin Settings
fr: Réglages de WP-Autoplugin
hu_hu: WP-Autoplugin beállítások

source: OpenAI API Key
fr: Clé API OpenAI
hu_hu: OpenAI API-kulcs

source: Anthropic API Key
fr: Clé API Anthropic
hu_hu: Anthropic API-kulcs

source: Google Gemini API Key
fr: Clé API Google Gemini
hu_hu: Google Gemini API-kulcs

source: Model
fr: Modèle
hu_hu: Modell

source: <code>chatgpt-4o-latest</code> continuously points to the version of GPT-4o used in ChatGPT, and is updated frequently.
fr: <code>chatgpt-4o-latest</code> pointe en permanence vers la version de GPT-4o utilisée dans ChatGPT, et est fréquemment mise à jour.
hu_hu: A <code>chatgpt-4o-latest</code> folyamatosan a ChatGPT által használt GPT-4o verzióra mutat, és gyakran frissül.

source: Model Name (User-defined Label)
hu_hu: Modell neve (Felhasználó által definiált címke)

source: API Endpoint URL
hu_hu: API végpont URL

source: "model" Parameter Value
hu_hu: A "model" paraméter értéke

source: API Key
hu_hu: API-kulcs

source: Additional Headers (one per line, name=value)
hu_hu: További fejlécadatok (soronként egy, név=érték)

source: Add Custom Model
hu_hu: Egyedi modell hozzáadása

source: Add any custom models you want to use with WP-Autoplugin. These models will be available in the model selection dropdown. The API must be compatible with the OpenAI API.
hu_hu: Adj hozzá bármilyen egyedi modellt, amelyet a WP-Autoplugin-nel szeretnél használni. Ezek a modellek elérhetőek lesznek a modellválasztó legördülő menüben. Az API-nak kompatibilisnek kell lennie az OpenAI API-val.

source: Details
hu_hu: Részletek

source: Model Parameter
hu_hu: Modell paraméter

source: Headers
hu_hu: Fejlécek

source: Remove
hu_hu: Eltávolítás

source: Please fill out all required fields.
hu_hu: Kérjük, töltsd ki az összes kötelező mezőt.

source: Are you sure you want to remove this model?
hu_hu: Biztosan el akarod távolítani ezt a modellt?

source: Error saving model
hu_hu: Hiba történt a modell mentése közben.
